tutor/app/controllers/problems_controller.rb

  def Create_Edit_Problem_Page
  	p = Problem.new(permitCreate)
  	if p.save
---
INSERT INTO "problems" ("created_at", "description", "title", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Thu, 27 Mar 2014 14:06:01 UTC +00:00], ["description", "desc"], ["title", "title"], ["updated_at", Thu, 27 Mar 2014 14:06:01 UTC +00:00]]

  def showCreate
  	@problems = Problem.all
---
SELECT "problems".* FROM "problems"

  def problemView
  	@problem = Problem.find_by_id(params[:id])
---
SELECT "problems".* FROM "problems" WHERE "problems"."id" IS NULL LIMIT 1